#+title: Client Server Socket Example
#+author: Marcus Birkenkrahe (pledged)
#+SEQ_TODO: TODO NEXT IN_PROGRESS | DONE
#+startup: overview hideblocks indent entitiespretty:
#+property: header-args:C :main yes :includes <stdio.h> :results output :exports both: :noweb yes
#+property: header-args:python :session *Python* :python python3 :results output :exports both:
#+property: header-args: R :session *R* :results output :exports both:
#+property: header-args:C++ :main yes :includes <iostream> :results output :exports both:
* Create TCP client socket

- Include standard header files:
  #+name: standard header files
  #+begin_src C :results none
    #include <stdio.h>
    #include <stdlib.h>
  #+end_src

- Include several special header files
  #+name: network header files
  #+begin_src C :results none
    #include <sys/types.h>
    #include <sys/socket.h>
    #include <netinet/in.h>
    #include <unistd.h>
  #+end_src

- Main program:
  #+begin_src C :noweb yes :tangle ./src/tcp_client.c :includes :main no
    <<standard header files>>
    <<network header files>>

    #define PORT 9002
    int main(void)
    {
      // Redirect stderr to stdout
      dup2(1,2);

      // create a socket
      int network_socket;
      // Use IPv4, TCP, default protocol
      network_socket = socket(AF_INET,SOCK_STREAM,0);

      // specify an address for the socket
      struct sockaddr_in server_address;
      server_address.sin_family = AF_INET; // IPv4
      server_address.sin_port = htons(PORT); // Convert port number
      server_address.sin_addr.s_addr = INADDR_ANY; // Use 0.0.0.0

      // connect to socket
      int connection_status =  // return 0 if ok, or -1
        connect(network_socket,
                (struct sockaddr *) &server_address,
                sizeof(server_address));
      // check for error with connection
      if (connection_status == -1) {
        perror("Connection error");
      }

      // receive some data from the server
      char server_response[250]; // empty string to hold data
      recv(network_socket,&server_response,sizeof(server_response),0);

      // print the data that we get back
      if (connection_status == 0) {
        printf("The server sent the data: %s",server_response);
      }

      // close the socket - unistd.h
      close(network_socket);
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Connection error: Connection refused

- To test, run this and you should get the output:
  #+begin_example
   Connection error: Connection refused.
  #+end_example

* Byte order - Host or Network?

- Hexadecimal is a human-friendly shorthand for binary. Memory
  addresses, file contents, network packets, color codes etc.

- Example:
  #+begin_src C
    int i = 1;  // initialize integer variable i with the value 1
    int *p = &i;  // pointer to the address of i
    printf("The hex address of i = %d is %p.\n",i,&p);
  #+end_src

  #+RESULTS:
  : The hex address of i = 1 is 0x7ffd9e83b3c0.

- Hex to decimal can be computed easily on the shell with ~bc~:
  #+begin_src bash :results output :exports both
    echo "ibase=16; B34F" | bc
    echo "obase=2;ibase=16; B34F" | bc
  #+end_src

- How does the hexadecimal -> decimal result come about?
  #+begin_quote
  | Pos | Hex | Decimal | 16^Pos | Contribution      |
  |-----+-----+---------+--------+-------------------|
  |   3 | B   |      11 |   4096 | 11 × 4096 = 45056 |
  |   2 | 3   |       3 |    256 | 3 × 256 = 768     |
  |   1 | 4   |       4 |     16 | 4 × 16 = 64       |
  |   0 | F   |      15 |      1 | 15 × 1 = 15       |
  |-----+-----+---------+--------+-------------------|
  |     |     |         |        | Total = *45903*     |
  #+end_quote
  #+begin_example
  Decimal:  0  1  2  3  4  5  6  7  8  9  10 11 12 13 14 15
  Hex:      0  1  2  3  4  5  6  7  8  9   A  B  C  D  E  F
  #+end_example

- Two-byte hexadecimal numbers like =B34F= (two words), are stored in
  sequential bytes - B3 followed by 4F. This number, stored with the
  "Big End" (B3) first, is called "Big-Endian".

- Intel- or Intel-compatible computers store the bytes reversed: So in
  memory, B34F is stored as the sequential bytes 4F followed by
  B3. This is called "Little-Endian" (little end first).

- "Big-Endian" is also called "Network Byte Order".

- Your computer stores numbers in "Host Byte Order". If the CPU's an
  Intel 80x86, Host Byte Order is Little-Endian. If it's a
  PowerPC..who knows.

- So you need to make sure two- and four-byte numbers are in Network
  Byte Order. This is what ~htons~ does for ~short~ (two bytes - used for
  port numbers, TCP headers, checksums) and ~htonl~ for ~long~ (four
  bytes - used for IPv4 addresses, TCP SEQ and ACK numbers, and
  timestamps).

- You can use different combinations:

  | *Function* | *Description*           |
  |----------+-----------------------|
  | ~htons~    | host to network short |
  | ~htonl~    | host to network long  |
  | ~ntohs~    | network to host short |
  | ~ntohl~    | network to host long  |

- Example:
  #+begin_src C :main no :includes :tangle htons.c
    #include <stdio.h>  // IO functions
    #include <arpa/inet.h> // contains `htons`

    #define PORT 9002

    int main(void)
    {
      printf("Port %hu = Host Byte Order | %X = Network Byte Order\n",
         PORT, htons(PORT));
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Port 9002 = Host Byte Order | 2A23 = Network Byte Order

- Confirm using ~bc~:
  #+begin_src bash :results output :exports both
    echo "obase=16; ibase=10; 9002" | bc
  #+end_src

  #+RESULTS:
  : 232A

* Networking a real world program

- We're building a web service that tells you what time it is right
  now. Users could navigate to our web page and get the time.

- You should always work out the local version of a program before
  networking it.

- The local, console version of the time-telling program:

  #+begin_src C :tangle time_console.c :main no :includes
    #include <stdio.h>  // for printf
    #include <time.h>   // for time-related functions

    int main()
    {
      time_t timer; // declare a variable of type time_t for  calendar time

      time(&timer); // get the current time and store it in 'timer'

      // convert the calendar time to a human-readable string and print it
      printf("Local time is: %s", ctime(&timer));

      return 0;           // indicate that the program finished successfully
    }
  #+end_src

  #+RESULTS:
  : Local time is: Fri Apr 11 11:46:48 2025

- When you pass =&timer=, you pass a memory location where the function
  can write the current time. For more, check ~man time(2)~. Then ~ctime~
  takes the ~time_t~-formatted time and converts it to a string to
  print - see ~man ctime(3)~.

** Suggestions for Experimentation

Try these to learn more:

1. *Print raw =timer= value*:
   #+BEGIN_SRC C
     #include <time.h>
     printf("Seconds since epoch: %ld\n", time);
   #+END_SRC

   #+RESULTS:
   : Seconds since epoch: 125674404552736

   Shows seconds since 1970.

2. *Add a loop to update time*:
   #+BEGIN_SRC C :results output
     #include <stdio.h>
     #include <time.h>
     #include <unistd.h>

     int main() {
       time_t timer;
       for (int i = 0; i < 5; i++) {
         time(&timer);
         printf("Local time is: %s", ctime(&timer));
         sleep(1);
       }
       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : Local time is: Sun Apr 13 22:33:21 2025
   : Local time is: Sun Apr 13 22:33:22 2025
   : Local time is: Sun Apr 13 22:33:23 2025
   : Local time is: Sun Apr 13 22:33:24 2025
   : Local time is: Sun Apr 13 22:33:25 2025

   Prints time every second for 5 seconds (=sleep= needs =unistd.h= on
   Unix-like systems).

3. *Use =gmtime= for UTC*:

   #+BEGIN_SRC C
     #include <time.h>

     time_t timer;
     struct tm *gmt = gmtime(&timer);

     printf("UTC time: %d-%d-%d %d:%d:%d\n",
            gmt->tm_year + 1900, gmt->tm_mon + 1, gmt->tm_mday,
            gmt->tm_hour, gmt->tm_min, gmt->tm_sec);
   #+END_SRC

   #+RESULTS:
   : UTC time: 1970-1-1 0:1:40

   Shows UTC time and introduces =struct tm=.

* Using ~make~ to build files from multiple sources

- Tangle the source code and build it with ~make~ using the built-in
  ~makefile~:
  #+begin_src bash :results output
    ls -lt time_console.c
    make time_console
  #+end_src

  #+RESULTS:
  : -rw-rw-r-- 1 marcus marcus 185 Apr 11 10:08 time_console.c
  : cc     time_console.c   -o time_console

- Run it:
  #+begin_src bash :results output
    ./time_console
  #+end_src

  #+RESULTS:
  : Local time is: Fri Apr 11 10:09:26 2025

- Write a =makefile= `maketime` that builds the executable =time_console=.
  #+begin_src C :main no :includes :tangle maketime
    time_console: time_console.c
    gcc time_console.c -o time_console
  #+end_src

- Run it:
  #+begin_src bash :results output
    touch time_console.c
    make -f maketime
    ./time_console
  #+end_src

  #+RESULTS:
  : gcc time_console.c -o time_console
  : Local time is: Fri Apr 11 10:42:15 2025

- Now split the file =time_console.c= into two parts:
  1. =time_console2.h= (with the header files only)
  2. =time_console2.c= (with the ~main~ program only)
  3. Add ~#include "time_console2.h"~ before the ~main~ program.

- Header file:
  #+begin_src C :main no :includes :tangle time_console2.h
    #include <stdio.h>  // for printf
    #include <time.h>   // for time-related functions
  #+end_src

- Main program:
  #+begin_src C :main no :includes :tangle time_console2.c
    #include "time_console2.h"

    int main()
    {
      time_t timer; // declare a variable of type time_t for  calendar time

      time(&timer); // get the current time and store it in 'timer'

      // convert the calendar time to a human-readable string and print it
      printf("Local time is: %s", ctime(&timer));

      return 0;           // indicate that the program finished successfully
    }
  #+end_src

- Create a suitable ~makefile~ called =maketime2=:
  #+begin_src C :tangle maketime2 :main no :includes
    time_console2.o: time_console2.c time_console2.h
    gcc -c time_console2.c -o time_console2.o

    time_console2: time_console2.o
    gcc time_console2.o -o time_console2

    clean:
    rm -f *.o time_console2
  #+end_src

- Check all files were created:
  #+begin_src bash :results output
    ls -lt maketime2 time_console2*
  #+end_src

  #+RESULTS:
  : -rw-rw-r-- 1 marcus marcus 1752 Apr 11 10:53 time_console2.o
  : -rw-rw-r-- 1 marcus marcus  372 Apr 11 10:49 time_console2.c
  : -rw-rw-r-- 1 marcus marcus  195 Apr 11 10:45 maketime2
  : -rw-rw-r-- 1 marcus marcus   84 Apr 11 10:44 time_console2.h

- Test the ~makefile~:
  #+begin_src bash :results output
    make -f maketime2 clean
    make -f maketime2
  #+end_src

  #+RESULTS:
  : rm -f *.o time_console2
  : gcc -c time_console2.c -o time_console2.o

- Run the executable:
  #+begin_src bash :results output
    pwd
  #+end_src

  #+RESULTS:
  : /home/marcus/GitHub/admin/spring25/csc410/org

* Compile and run the program

- Compile the program:
  #+begin_src bash :results output
    make time_server
  #+end_src

  #+RESULTS:
  : cc     time_server.c   -o time_server

- Start the server on the terminal (=M-x term /usr/bin/bash=) or open
  another fully functional terminal outside of Emacs.

- Start the server with =./time_server=

- When you see the ="Waiting for connection..."= message, open a web
  browser to the address =127.0.0.1:8080= or =localhost:8080=.

- This is what you should see:
  #+begin_example
  $ ./time_server
  Configuring local address...
  Creating socket...
  Binding socket to local address...
  Listening...
  Waiting for connection...
  Client is connected... 127.0.0.1
  Reading request...
  Received 660 bytes.
  Sending response...
  Sent 79 of 79 bytes.
  Sent 25 of 25 bytes.
  Closing requesting (client) connection...
  Closing listening (server) connection...
  Finished.
  $
  #+end_example

- If you restart the server immediately after this, you may get a
  =bind() failed. (98)= error. This is the ~EADDRINUSE~ error code from
  ~<errno.h>~.

- For the location of ~<errno.h>~ in ~/usr/include~ (std header files):
  #+begin_src bash :results output :exports both
    grep -r "#define.*\b98\b" /usr/include | grep errno.h
  #+end_src

  #+RESULTS:
  : /usr/include/asm-generic/errno.h:#define    EADDRINUSE      98      /* Address already in use */

- The port =8080= was still in use because that port is still in
  ~TIME_WAIT~ state for a short period to make sure any lingering
  packets are handled, about 30-60 seconds.

- Fix this by calling ~setsockopt(2)~ after ~socket~ but before ~bind~:
  #+name: enable immediate socket reuse
  #+begin_src C :main no :includes :results none
    int opt = 1; // flag to enable socket option
    setsockopt(socket_listen, // socket on which the server listens
               SOL_SOCKET, // change options at the sockets API level
               SO_REUSEADDR, // option name
               &opt, // option value (switch on)
               sizeof(opt)); // length of option value
  #+end_src

- Insert this into the ~main~ program before the =<<bind...>>= code:
  #+begin_example C
      <<enable immediate socket reuse>>
  #+end_example

- Then tangle =time_server.c=, ~make time_server~ again, start the server,
  get the time, restart the server and try to get the time immediately
  and it should work now.

- Alternative check: Use ~netcat~ (~nc~) if you have it:
  #+begin_example bash
    nc localhost 8080
  #+end_example

- Output:
  #+begin_example
  HTTP/1.1 200 OK
  Connection: close
  Content-Type: text/plain

  Local time is: Mon Apr 14 20:24:22 2025
  #+end_example

** Modify the Program

- Remove socket code (~socket~, ~bind~, etc.).
- Read client request from ~stdin~ (optional, for HTTP).
- Write HTTP response and time to ~stdout~.
- Add =#include <time.h>= for time functions.
- ~fgets~ reads HTTP request (e.g. from browser).
- ~fputs~ write response to ~stdout~, sent to client.
- ~fflush(stdout)~ ensures data is sent before exit.

- Code: You can run this file since it writes to ~stdout~, but you
  should tangle it as =time_inetd.c= and =make time_inetd= it.
  #+BEGIN_SRC C :main no :includes :tangle time_inetd.c :results output
    #include <stdio.h>
    #include <string.h>
    #include <time.h>

    int main(void) {
      // Read request from stdin (optional, to handle HTTP clients)
      char request[1024];
      if (fgets(request, sizeof(request), stdin) == NULL) {
        fprintf(stderr, "No input received\n");
      }

      // Prepare HTTP response
      const char *header =
        "HTTP/1.1 200 OK\r\n"
        "Connection: close\r\n"
        "Content-Type: text/plain\r\n\r\n"
        "Local time is: ";
      fputs(header, stdout);

      // Get and send time
      time_t timer;
      time(&timer);
      char *time_msg = ctime(&timer);
      fputs(time_msg, stdout);
      fflush(stdout); // Ensure output is sent

      return 0;
    }
  #+END_SRC

  #+RESULTS:
  : HTTP/1.1 200 OK
  : Connection: close
  : Content-Type: text/plain
  : 
  : Local time is: Mon Apr 14 20:08:35 2025

- Build it:
  #+begin_src bash :results output :exports both
    make time_inetd
  #+end_src

  #+RESULTS:
  : cc     time_inetd.c   -o time_inetd

- Move the executable to ~/usr/local/bin~
  #+begin_example bash
  mv -v time_inetd /usr/local/bin/time_inetd
  which time_inetd
  #+end_example

